nxp-mcuxpresso/mcux-soc-svd/MIMXRT1024/MIMXRT1024.xml
<?xml version="1.0" encoding="UTF-8"?>
<device schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>nxp.com</vendor>
  <name>MIMXRT1024</name>
  <version>1.0</version>
  <description>MIMXRT1024DAG5A</description>
  <licenseText>
Copyright 2016-2026 NXP
SPDX-License-Identifier: BSD-3-Clause
  </licenseText>
  <cpu>
    <name>CM7</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>true</fpuPresent>
    <vtorPresent>true</vtorPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
    <peripheral>
      <name>AIPSTZ1</name>
      <description>AIPSTZ Control Registers</description>
      <groupName>AIPSTZ</groupName>
      <prependToName>AIPSTZ1_</prependToName>
      <headerStructName>AIPSTZ</headerStructName>
      <baseAddress>0x4007C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MPR</name>
          <description>Master Priviledge Registers</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x77000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MPROT3</name>
              <description>Master 3 Priviledge, Buffer, Read, Write Control.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MTR0</name>
                  <description>This master is not trusted for read accesses.</description>
                  <value>#x0xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTW0</name>
                  <description>This master is not trusted for write accesses.</description>
                  <value>#xx0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPL0</name>
                  <description>Accesses from this master are forced to user-mode (ips_supervisor_access is forced to zero) regardless of the hprot[1] access attribute.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPL1</name>
                  <description>Accesses from this master are not forced to user-mode. The hprot[1] access attribute is used directly to determine ips_supervisor_access.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTW1</name>
                  <description>This master is trusted for write accesses.</description>
                  <value>#xx1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTR1</name>
                  <description>This master is trusted for read accesses.</description>
                  <value>#x1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBW1</name>
                  <description>Write accesses from this master are allowed to be buffered</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPROT2</name>
              <description>Master 2 Priviledge, Buffer, Read, Write Control</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MTR0</name>
                  <description>This master is not trusted for read accesses.</description>
                  <value>#x0xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTW0</name>
                  <description>This master is not trusted for write accesses.</description>
                  <value>#xx0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPL0</name>
                  <description>Accesses from this master are forced to user-mode (ips_supervisor_access is forced to zero) regardless of the hprot[1] access attribute.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPL1</name>
                  <description>Accesses from this master are not forced to user-mode. The hprot[1] access attribute is used directly to determine ips_supervisor_access.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTW1</name>
                  <description>This master is trusted for write accesses.</description>
                  <value>#xx1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTR1</name>
                  <description>This master is trusted for read accesses.</description>
                  <value>#x1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBW1</name>
                  <description>Write accesses from this master are allowed to be buffered</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPROT1</name>
              <description>Master 1 Priviledge, Buffer, Read, Write Control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MTR0</name>
                  <description>This master is not trusted for read accesses.</description>
                  <value>#x0xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTW0</name>
                  <description>This master is not trusted for write accesses.</description>
                  <value>#xx0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPL0</name>
                  <description>Accesses from this master are forced to user-mode (ips_supervisor_access is forced to zero) regardless of the hprot[1] access attribute.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPL1</name>
                  <description>Accesses from this master are not forced to user-mode. The hprot[1] access attribute is used directly to determine ips_supervisor_access.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTW1</name>
                  <description>This master is trusted for write accesses.</description>
                  <value>#xx1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTR1</name>
                  <description>This master is trusted for read accesses.</description>
                  <value>#x1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBW1</name>
                  <description>Write accesses from this master are allowed to be buffered</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MPROT0</name>
              <description>Master 0 Priviledge, Buffer, Read, Write Control</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MTR0</name>
                  <description>This master is not trusted for read accesses.</description>
                  <value>#x0xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTW0</name>
                  <description>This master is not trusted for write accesses.</description>
                  <value>#xx0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPL0</name>
                  <description>Accesses from this master are forced to user-mode (ips_supervisor_access is forced to zero) regardless of the hprot[1] access attribute.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPL1</name>
                  <description>Accesses from this master are not forced to user-mode. The hprot[1] access attribute is used directly to determine ips_supervisor_access.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTW1</name>
                  <description>This master is trusted for write accesses.</description>
                  <value>#xx1x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTR1</name>
                  <description>This master is trusted for read accesses.</description>
                  <value>#x1xx</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBW1</name>
                  <description>Write accesses from this master are allowed to be buffered</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
