nxp-mcuxpresso/mcux-soc-svd/MIMXRT1024/MIMXRT1024.xml
        <register>
          <name>GPR11</name>
          <description>GPR11 General Purpose Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M7_APC_AC_R0_CTRL</name>
              <description>Access control of memory region-0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M7_APC_AC_R0_CTRL_0</name>
                  <description>No access protection - All accesses are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7_APC_AC_R0_CTRL_1</name>
                  <description>M7 debug protection enabled - The APC block will block CM7 breakpoints, watchpoints and trace to the GPR_M7_APC_AC_R0_TOP/BOT specified region (IOMUX_GPR_GPR18 - IOMUX_GPR_GPR19)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_APC_AC_R1_CTRL</name>
              <description>Access control of memory region-1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M7_APC_AC_R1_CTRL_0</name>
                  <description>No access protection - All accesses are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7_APC_AC_R1_CTRL_1</name>
                  <description>M7 debug protection enabled - The APC block will block CM7 breakpoints, watchpoints and trace to the GPR_M7_APC_AC_R1_TOP/BOT specified region (IOMUX_GPR_GPR20 - IOMUX_GPR_GPR21)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_APC_AC_R2_CTRL</name>
              <description>Access control of memory region-2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M7_APC_AC_R2_CTRL_0</name>
                  <description>No access protection - All accesses are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7_APC_AC_R2_CTRL_1</name>
                  <description>M7 debug protection enabled - The APC block will block CM7 breakpoints, watchpoints and trace to the GPR_M7_APC_AC_R2_TOP/BOT specified region (IOMUX_GPR_GPR22 - IOMUX_GPR_GPR23)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_APC_AC_R3_CTRL</name>
              <description>Access control of memory region-3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M7_APC_AC_R3_CTRL_0</name>
                  <description>No access protection - All accesses are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7_APC_AC_R3_CTRL_1</name>
                  <description>M7 debug protection enabled - The APC block will block CM7 breakpoints, watchpoints and trace to the GPR_M7_APC_AC_R3_TOP/BOT specified region (IOMUX_GPR_GPR24 - IOMUX_GPR_GPR25)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEE_DE_RX_EN</name>
              <description>BEE data decryption of memory region-n (n = 3 to 0).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BEE_DE_RX_EN_0</name>
                  <description>FlexSPI data decryption disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEE_DE_RX_EN_1</name>
                  <description>FlexSPI data decryption enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_M7_APC_AC_R0_CTRL</name>
              <description>Lock M7_APC_AC_R0_CTRL field for changes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R0_CTRL_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R0_CTRL_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_M7_APC_AC_R1_CTRL</name>
              <description>Lock M7_APC_AC_R1_CTRL field for changes</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R1_CTRL_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R1_CTRL_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_M7_APC_AC_R2_CTRL</name>
              <description>Lock M7_APC_AC_R2_CTRL field for changes</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R2_CTRL_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R2_CTRL_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_M7_APC_AC_R3_CTRL</name>
              <description>Lock M7_APC_AC_R3_CTRL field for changes</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R3_CTRL_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_M7_APC_AC_R3_CTRL_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_BEE_DE_RX_EN</name>
              <description>Lock BEE_DE_RX_EN[n] (n = 3 to 0) field for changes</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK_BEE_DE_RX_EN_0</name>
                  <description>Field is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK_BEE_DE_RX_EN_1</name>
                  <description>Field is locked (read access only)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR12</name>
          <description>GPR12 General Purpose Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FLEXIO1_IPG_STOP_MODE</name>
              <description>FlexIO1 stop mode selection. Cannot change when ipg_stop is asserted.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO1_IPG_STOP_MODE_0</name>
                  <description>FlexIO1 is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO1_IPG_STOP_MODE_1</name>
                  <description>When this bit is equal to 1'b1 and ipg_stop is asserted, FlexIO1 is not functional in Stop mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO1_IPG_DOZE</name>
              <description>FLEXIO1 ipg_doze mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO1_IPG_DOZE_0</name>
                  <description>FLEXIO1 is not in doze mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO1_IPG_DOZE_1</name>
                  <description>FLEXIO1 is in doze mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP_IPG_STOP_MODE</name>
              <description>ACMP stop mode selection. Cannot change when ipg_stop is asserted.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP_IPG_STOP_MODE_0</name>
                  <description>ACMP is functional in Stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_IPG_STOP_MODE_1</name>
                  <description>When this bit is equal to 1'b1 and ipg_stop is asserted, ACMP is not functional in Stop mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR13</name>
          <description>GPR13 General Purpose Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ARCACHE_USDHC</name>
              <description>uSDHC block cacheable attribute value of AXI read transactions</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARCACHE_USDHC_0</name>
                  <description>Cacheable attribute is off for read transactions</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARCACHE_USDHC_1</name>
                  <description>Cacheable attribute is on for read transactions</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AWCACHE_USDHC</name>
              <description>uSDHC block cacheable attribute value of AXI write transactions</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AWCACHE_USDHC_0</name>
                  <description>Cacheable attribute is off for write transactions</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AWCACHE_USDHC_1</name>
                  <description>Cacheable attribute is on for write transactions</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHE_ENET</name>
              <description>ENET block cacheable attribute value of AXI transactions</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CACHE_ENET_0</name>
                  <description>Cacheable attribute is off for read/write transactions</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CACHE_ENET_1</name>
                  <description>Cacheable attribute is on for read/write transactions</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHE_USB</name>
              <description>USB block cacheable attribute value of AXI transactions</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CACHE_USB_0</name>
                  <description>Cacheable attribute is off for read/write transactions</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CACHE_USB_1</name>
                  <description>Cacheable attribute is on for read/write transactions</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
