nxp-mcuxpresso/mcux-soc-svd/MIMXRT1024/MIMXRT1024.xml
        <register>
          <name>CSCDR2</name>
          <description>CCM Serial Clock Divider Register 2</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x29150</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPI2C_CLK_SEL</name>
              <description>Selector for the LPI2C clock multiplexor</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C_CLK_SEL_0</name>
                  <description>derive clock from pll3_60m</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C_CLK_SEL_1</name>
                  <description>derive clock from osc_clk</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C_CLK_PODF</name>
              <description>Divider for lpi2c clock podf. Divider should be updated when output clock is gated. The input clock to this divider should be lower than 300Mhz, the predivider can be used to achieve this.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVIDE_1</name>
                  <description>Divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_2</name>
                  <description>Divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_3</name>
                  <description>Divide by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_4</name>
                  <description>Divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_5</name>
                  <description>Divide by 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_6</name>
                  <description>Divide by 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_7</name>
                  <description>Divide by 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_8</name>
                  <description>Divide by 8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_9</name>
                  <description>Divide by 9</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_10</name>
                  <description>Divide by 10</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_11</name>
                  <description>Divide by 11</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_12</name>
                  <description>Divide by 12</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_13</name>
                  <description>Divide by 13</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_14</name>
                  <description>Divide by 14</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_15</name>
                  <description>Divide by 15</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_16</name>
                  <description>Divide by 16</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_17</name>
                  <description>Divide by 17</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_18</name>
                  <description>Divide by 18</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_19</name>
                  <description>Divide by 19</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_20</name>
                  <description>Divide by 20</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_21</name>
                  <description>Divide by 21</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_22</name>
                  <description>Divide by 22</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_23</name>
                  <description>Divide by 23</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_24</name>
                  <description>Divide by 24</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_25</name>
                  <description>Divide by 25</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_26</name>
                  <description>Divide by 26</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_27</name>
                  <description>Divide by 27</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_28</name>
                  <description>Divide by 28</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_29</name>
                  <description>Divide by 29</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_30</name>
                  <description>Divide by 30</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_31</name>
                  <description>Divide by 31</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_32</name>
                  <description>Divide by 32</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_33</name>
                  <description>Divide by 33</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_34</name>
                  <description>Divide by 34</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_35</name>
                  <description>Divide by 35</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_36</name>
                  <description>Divide by 36</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_37</name>
                  <description>Divide by 37</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_38</name>
                  <description>Divide by 38</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_39</name>
                  <description>Divide by 39</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_40</name>
                  <description>Divide by 40</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_41</name>
                  <description>Divide by 41</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_42</name>
                  <description>Divide by 42</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_43</name>
                  <description>Divide by 43</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_44</name>
                  <description>Divide by 44</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_45</name>
                  <description>Divide by 45</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_46</name>
                  <description>Divide by 46</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_47</name>
                  <description>Divide by 47</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_48</name>
                  <description>Divide by 48</description>
                  <value>0x2F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_49</name>
                  <description>Divide by 49</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_50</name>
                  <description>Divide by 50</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_51</name>
                  <description>Divide by 51</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_52</name>
                  <description>Divide by 52</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_53</name>
                  <description>Divide by 53</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_54</name>
                  <description>Divide by 54</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_55</name>
                  <description>Divide by 55</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_56</name>
                  <description>Divide by 56</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_57</name>
                  <description>Divide by 57</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_58</name>
                  <description>Divide by 58</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_59</name>
                  <description>Divide by 59</description>
                  <value>0x3A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_60</name>
                  <description>Divide by 60</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_61</name>
                  <description>Divide by 61</description>
                  <value>0x3C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_62</name>
                  <description>Divide by 62</description>
                  <value>0x3D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_63</name>
                  <description>Divide by 63</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_64</name>
                  <description>Divide by 64</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCDR3</name>
          <description>CCM Serial Clock Divider Register 3</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x30841</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CDHIPR</name>
          <description>CCM Divider Handshake In-Process Register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEMC_PODF_BUSY</name>
              <description>Busy indicator for semc_podf.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEMC_PODF_BUSY_0</name>
                  <description>divider is not busy and its value represents the actual division.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEMC_PODF_BUSY_1</name>
                  <description>divider is busy with handshake process with module. The value read in the divider represents the previous value of the division factor, and after the handshake the written value of the semc_podf will be applied.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_PODF_BUSY</name>
              <description>Busy indicator for ahb_podf.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHB_PODF_BUSY_0</name>
                  <description>divider is not busy and its value represents the actual division.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB_PODF_BUSY_1</name>
                  <description>divider is busy with handshake process with module. The value read in the divider represents the previous value of the division factor, and after the handshake the written value of the ahb_podf will be applied.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERIPH2_CLK_SEL_BUSY</name>
              <description>Busy indicator for periph2_clk_sel mux control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PERIPH2_CLK_SEL_BUSY_0</name>
                  <description>mux is not busy and its value represents the actual division.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH2_CLK_SEL_BUSY_1</name>
                  <description>mux is busy with handshake process with module. The value read in the periph2_clk_sel represents the previous value of select, and after the handshake periph2_clk_sel value will be applied.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERIPH_CLK_SEL_BUSY</name>
              <description>Busy indicator for periph_clk_sel mux control.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PERIPH_CLK_SEL_BUSY_0</name>
                  <description>mux is not busy and its value represents the actual division.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_CLK_SEL_BUSY_1</name>
                  <description>mux is busy with handshake process with module. The value read in the periph_clk_sel represents the previous value of select, and after the handshake periph_clk_sel value will be applied.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARM_PODF_BUSY</name>
              <description>Busy indicator for arm_podf.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARM_PODF_BUSY_0</name>
                  <description>divider is not busy and its value represents the actual division.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARM_PODF_BUSY_1</name>
                  <description>divider is busy with handshake process with module. The value read in the divider represents the previous value of the division factor, and after the handshake the written value of the arm_podf will be applied.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
