nxp-mcuxpresso/mcux-soc-svd/MIMXRT1024/MIMXRT1024.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>USB</name>
      <description>USB</description>
      <groupName>USB</groupName>
      <prependToName>USB_</prependToName>
      <baseAddress>0x402E0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1E0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USB_OTG1</name>
        <value>113</value>
      </interrupt>
      <registers>
        <register>
          <name>ID</name>
          <description>Identification register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xE4A1FA05</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ID</name>
              <description>Configuration number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NID</name>
              <description>Complement version of ID</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>Revision number of the controller core.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HWGENERAL</name>
          <description>Hardware General</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x35</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PHYW</name>
              <description>Data width of the transciever connected to the controller core. PHYW bit reset value is</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PHYW_0</name>
                  <description>8 bit wide data bus Software non-programmable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHYW_1</name>
                  <description>16 bit wide data bus Software non-programmable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHYW_2</name>
                  <description>Reset to 8 bit wide data bus Software programmable</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHYW_3</name>
                  <description>Reset to 16 bit wide data bus Software programmable</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYM</name>
              <description>Transciever type</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PHYM_0</name>
                  <description>UTMI/UMTI+</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHYM_1</name>
                  <description>ULPI DDR</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHYM_2</name>
                  <description>ULPI</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHYM_3</name>
                  <description>Serial Only</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHYM_4</name>
                  <description>Software programmable - reset to UTMI/UTMI+</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHYM_5</name>
                  <description>Software programmable - reset to ULPI DDR</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHYM_6</name>
                  <description>Software programmable - reset to ULPI</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHYM_7</name>
                  <description>Software programmable - reset to Serial</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM</name>
              <description>Serial interface mode capability</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM_0</name>
                  <description>No Serial Engine, always use parallel signalling.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM_1</name>
                  <description>Serial Engine present, always use serial signalling for FS/LS.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM_2</name>
                  <description>Software programmable - Reset to use parallel signalling for FS/LS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM_3</name>
                  <description>Software programmable - Reset to use serial signalling for FS/LS</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HWHOST</name>
          <description>Host Hardware Parameters</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x10020001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HC</name>
              <description>Host Capable. Indicating whether host operation mode is supported or not.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HC_0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HC_1</name>
                  <description>Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NPORT</name>
              <description>The Nmber of downstream ports supported by the host controller is (NPORT+1)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HWDEVICE</name>
          <description>Device Hardware Parameters</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x11</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DC</name>
              <description>Device Capable. Indicating whether device operation mode is supported or not.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DC_0</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_1</name>
                  <description>Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEVEP</name>
              <description>Device Endpoint Number</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HWTXBUF</name>
          <description>TX Buffer Hardware Parameters</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x80080B08</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXBURST</name>
              <description>Default burst size for memory to TX buffer transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXCHANADD</name>
              <description>TX FIFO Buffer size is: (2^TXCHANADD) * 4 Bytes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HWRXBUF</name>
          <description>RX Buffer Hardware Parameters</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x808</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXBURST</name>
              <description>Default burst size for memory to RX buffer transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXADD</name>
              <description>Buffer total size for all receive endpoints is (2^RXADD)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPTIMER0LD</name>
          <description>General Purpose Timer #0 Load</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPTLD</name>
              <description>General Purpose Timer Load Value These bit fields are loaded to GPTCNT bits when GPTRST bit is set '1b'</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPTIMER0CTRL</name>
          <description>General Purpose Timer #0 Controller</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPTCNT</name>
              <description>General Purpose Timer Counter. This field is the count value of the countdown timer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTMODE</name>
              <description>General Purpose Timer Mode In one shot mode, the timer will count down to zero, generate an interrupt, and stop until the counter is reset by software; In repeat mode, the timer will count down to zero, generate an interrupt and automatically reload the counter value from GPTLD bits to start again</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPTMODE_0</name>
                  <description>One Shot Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPTMODE_1</name>
                  <description>Repeat Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPTRST</name>
              <description>General Purpose Timer Reset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPTRST_0</name>
                  <description>No action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPTRST_1</name>
                  <description>Load counter value from GPTLD bits in n_GPTIMER0LD</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPTRUN</name>
              <description>General Purpose Timer Run GPTCNT bits are not effected when setting or clearing this bit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPTRUN_0</name>
                  <description>Stop counting</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPTRUN_1</name>
                  <description>Run</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPTIMER1LD</name>
          <description>General Purpose Timer #1 Load</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPTLD</name>
              <description>General Purpose Timer Load Value These bit fields are loaded to GPTCNT bits when GPTRST bit is set '1b'</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPTIMER1CTRL</name>
          <description>General Purpose Timer #1 Controller</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPTCNT</name>
              <description>General Purpose Timer Counter. This field is the count value of the countdown timer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPTMODE</name>
              <description>General Purpose Timer Mode In one shot mode, the timer will count down to zero, generate an interrupt, and stop until the counter is reset by software</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPTMODE_0</name>
                  <description>One Shot Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPTMODE_1</name>
                  <description>Repeat Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPTRST</name>
              <description>General Purpose Timer Reset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPTRST_0</name>
                  <description>No action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPTRST_1</name>
                  <description>Load counter value from GPTLD bits in USB_n_GPTIMER0LD</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPTRUN</name>
              <description>General Purpose Timer Run GPTCNT bits are not effected when setting or clearing this bit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPTRUN_0</name>
                  <description>Stop counting</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPTRUN_1</name>
                  <description>Run</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SBUSCFG</name>
          <description>System Bus Config</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AHBBRST</name>
              <description>AHB master interface Burst configuration These bits control AHB master transfer type sequence (or priority)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHBBRST_0</name>
                  <description>Incremental burst of unspecified length only</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHBBRST_1</name>
                  <description>INCR4 burst, then single transfer</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHBBRST_2</name>
                  <description>INCR8 burst, INCR4 burst, then single transfer</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHBBRST_3</name>
                  <description>INCR16 burst, INCR8 burst, INCR4 burst, then single transfer</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHBBRST_5</name>
                  <description>INCR4 burst, then incremental burst of unspecified length</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHBBRST_6</name>
                  <description>INCR8 burst, INCR4 burst, then incremental burst of unspecified length</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHBBRST_7</name>
                  <description>INCR16 burst, INCR8 burst, INCR4 burst, then incremental burst of unspecified length</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CAPLENGTH</name>
          <description>Capability Registers Length</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x40</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>CAPLENGTH</name>
              <description>These bits are used as an offset to add to register base to find the beginning of the Operational Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCIVERSION</name>
          <description>Host Controller Interface Version</description>
          <addressOffset>0x102</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>HCIVERSION</name>
              <description>Host Controller Interface Version Number Default value is '10h', which means EHCI rev1.0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
