nxp-mcuxpresso/mcux-soc-svd/MIMXRT1024/MIMXRT1024.xml
        <register>
          <name>CH3STAT</name>
          <description>DCP channel 3 status register</description>
          <addressOffset>0x1E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HASH_MISMATCH</name>
              <description>This bit indicates that a hashing check operation is mismatched for the control packets that enable the HASH_CHECK bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SETUP</name>
              <description>This bit indicates that the hardware detected an invalid programming configuration (such as a buffer length that is not a multiple of the natural data size for the operation)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PACKET</name>
              <description>This bit indicates that a bus error occurred when reading the packet or payload or when writing the status back to the packet paylaod</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SRC</name>
              <description>This bit indicates that a bus error occurred when reading from the source buffer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_DST</name>
              <description>This bit indicates that a bus error occurred when storing to the destination buffer</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PAGEFAULT</name>
              <description>This bit indicates that a page fault occurred while converting a virtual address to a physical address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_CODE</name>
              <description>Indicates additional error codes for some of the error conditions.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEXT_CHAIN_IS_0</name>
                  <description>Error is signalled because the next pointer is 0x00000000.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CHAIN</name>
                  <description>Error is signalled because the semaphore is of a non-zero value and neither of the chain bits is set.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTEXT_ERROR</name>
                  <description>Error is signalled because an error was reported while reading/writing the context buffer.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_ERROR</name>
                  <description>Error is signalled because an error was reported while reading/writing the payload.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_MODE</name>
                  <description>Error is signalled because the control packet specifies an invalid mode select (for example, blit + hash).</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAG</name>
              <description>Indicates the tag from the last completed packet in the command structure.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3STAT_SET</name>
          <description>DCP channel 3 status register</description>
          <addressOffset>0x1E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HASH_MISMATCH</name>
              <description>This bit indicates that a hashing check operation is mismatched for the control packets that enable the HASH_CHECK bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SETUP</name>
              <description>This bit indicates that the hardware detected an invalid programming configuration (such as a buffer length that is not a multiple of the natural data size for the operation)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PACKET</name>
              <description>This bit indicates that a bus error occurred when reading the packet or payload or when writing the status back to the packet paylaod</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SRC</name>
              <description>This bit indicates that a bus error occurred when reading from the source buffer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_DST</name>
              <description>This bit indicates that a bus error occurred when storing to the destination buffer</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PAGEFAULT</name>
              <description>This bit indicates that a page fault occurred while converting a virtual address to a physical address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_CODE</name>
              <description>Indicates additional error codes for some of the error conditions.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEXT_CHAIN_IS_0</name>
                  <description>Error is signalled because the next pointer is 0x00000000.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CHAIN</name>
                  <description>Error is signalled because the semaphore is of a non-zero value and neither of the chain bits is set.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTEXT_ERROR</name>
                  <description>Error is signalled because an error was reported while reading/writing the context buffer.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_ERROR</name>
                  <description>Error is signalled because an error was reported while reading/writing the payload.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_MODE</name>
                  <description>Error is signalled because the control packet specifies an invalid mode select (for example, blit + hash).</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAG</name>
              <description>Indicates the tag from the last completed packet in the command structure.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3STAT_CLR</name>
          <description>DCP channel 3 status register</description>
          <addressOffset>0x1E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HASH_MISMATCH</name>
              <description>This bit indicates that a hashing check operation is mismatched for the control packets that enable the HASH_CHECK bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SETUP</name>
              <description>This bit indicates that the hardware detected an invalid programming configuration (such as a buffer length that is not a multiple of the natural data size for the operation)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PACKET</name>
              <description>This bit indicates that a bus error occurred when reading the packet or payload or when writing the status back to the packet paylaod</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SRC</name>
              <description>This bit indicates that a bus error occurred when reading from the source buffer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_DST</name>
              <description>This bit indicates that a bus error occurred when storing to the destination buffer</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PAGEFAULT</name>
              <description>This bit indicates that a page fault occurred while converting a virtual address to a physical address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_CODE</name>
              <description>Indicates additional error codes for some of the error conditions.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEXT_CHAIN_IS_0</name>
                  <description>Error is signalled because the next pointer is 0x00000000.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CHAIN</name>
                  <description>Error is signalled because the semaphore is of a non-zero value and neither of the chain bits is set.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTEXT_ERROR</name>
                  <description>Error is signalled because an error was reported while reading/writing the context buffer.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_ERROR</name>
                  <description>Error is signalled because an error was reported while reading/writing the payload.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_MODE</name>
                  <description>Error is signalled because the control packet specifies an invalid mode select (for example, blit + hash).</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAG</name>
              <description>Indicates the tag from the last completed packet in the command structure.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3STAT_TOG</name>
          <description>DCP channel 3 status register</description>
          <addressOffset>0x1EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HASH_MISMATCH</name>
              <description>This bit indicates that a hashing check operation is mismatched for the control packets that enable the HASH_CHECK bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SETUP</name>
              <description>This bit indicates that the hardware detected an invalid programming configuration (such as a buffer length that is not a multiple of the natural data size for the operation)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PACKET</name>
              <description>This bit indicates that a bus error occurred when reading the packet or payload or when writing the status back to the packet paylaod</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_SRC</name>
              <description>This bit indicates that a bus error occurred when reading from the source buffer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_DST</name>
              <description>This bit indicates that a bus error occurred when storing to the destination buffer</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_PAGEFAULT</name>
              <description>This bit indicates that a page fault occurred while converting a virtual address to a physical address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERROR_CODE</name>
              <description>Indicates additional error codes for some of the error conditions.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEXT_CHAIN_IS_0</name>
                  <description>Error is signalled because the next pointer is 0x00000000.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CHAIN</name>
                  <description>Error is signalled because the semaphore is of a non-zero value and neither of the chain bits is set.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTEXT_ERROR</name>
                  <description>Error is signalled because an error was reported while reading/writing the context buffer.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAYLOAD_ERROR</name>
                  <description>Error is signalled because an error was reported while reading/writing the payload.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_MODE</name>
                  <description>Error is signalled because the control packet specifies an invalid mode select (for example, blit + hash).</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAG</name>
              <description>Indicates the tag from the last completed packet in the command structure.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3OPTS</name>
          <description>DCP channel 3 options register</description>
          <addressOffset>0x1F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECOVERY_TIMER</name>
              <description>This field indicates the recovery time for the channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3OPTS_SET</name>
          <description>DCP channel 3 options register</description>
          <addressOffset>0x1F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECOVERY_TIMER</name>
              <description>This field indicates the recovery time for the channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3OPTS_CLR</name>
          <description>DCP channel 3 options register</description>
          <addressOffset>0x1F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECOVERY_TIMER</name>
              <description>This field indicates the recovery time for the channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3OPTS_TOG</name>
          <description>DCP channel 3 options register</description>
          <addressOffset>0x1FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECOVERY_TIMER</name>
              <description>This field indicates the recovery time for the channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGSELECT</name>
          <description>DCP debug select register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INDEX</name>
              <description>Selects a value to read via the debug data register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTROL</name>
                  <description>CONTROL</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OTPKEY0</name>
                  <description>OTPKEY0</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OTPKEY1</name>
                  <description>OTPKEY1</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OTPKEY2</name>
                  <description>OTPKEY2</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OTPKEY3</name>
                  <description>OTPKEY3</description>
                  <value>0x13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGDATA</name>
          <description>DCP debug data register</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Debug data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
